gdobato/Embedded_Cave/src/Project/Stm32F429_FreeRTOS/main.c
/**
 * @file 
 * @author 
 * @date
 * @brief
 **/

/************************************
* Includes
************************************/
//Std
#include <string.h>

//Os objects
#include "FreeRTOS.h"
#include <debugTask.h>
#include <debug.h>
#include <led/ledTask.h>
#include <stats/statsThread.h>

//Bsp
#include "stm32f4xx_hal.h"
#include <hal/hal.h>
#include <adc/adc.h>
#include <dma/dma.h>
#include <fmc/fmc.h>
#include <gpio/gpio.h>
#include <i2c/i2c.h>
#include <ltdc/ltdc.h>
#include <spi/spi.h>
#include <system/system.h>
#include <timer/timer.h>
#include <usart/usart.h>

/************************************
* Private definitions 
************************************/

/************************************
* Private type definitions 
************************************/

/************************************
* Private variables
************************************/


/************************************
* Private declarations 
************************************/
static void Error_Handler(void);

/************************************
* Implementation 
************************************/
int main(void)
{
  /* Init BSP*/
  HAL_Init();
  Gpio_Init();
  Adc_Init();
  Dma_Init();
  Usart_Init();
  Spi_Init();
  I2c_Init();
  Timer_Init();
  Fmc_Init();
  
  /* Initialize Os objects */
  //Queues
  xQueueHandle* xQueueDebug = DebugTask_GetQueue();
  *xQueueDebug = xQueueCreate(3 ,512);
  //Tasks
  xTaskCreate(vTaskDebug , "Debug"  ,  512, NULL, 1, NULL );
  xTaskCreate(vTaskLed   , "Led"    , 1024, NULL, 1, NULL );
  xTaskCreate(vTaskStats , "Stats"  , 2048, NULL, 1, NULL );

  /*Start Os*/
  vTaskStartScheduler();

  
  while (1)
  {
    Error_Handler();
  }

  return 0;
}

void Error_Handler(void)
{

}

